app/controllers/movies_controller.rb

  def similar
    movie = Movie.find(params[:movie_id])
    @similar_movies = Movie.where('id != ? AND director = ?', params[:movie_id], movie.director)
    if(@similar_movies.empty?)
---
SELECT "movies".* FROM "movies" WHERE (id != '1' AND director = 'George Lucas')
SELECT COUNT(*) FROM "movies" WHERE (id != '2' AND director = 'Ridley Scott')